TexasInstruments/c2000ware-core-sdk/driverlib/f28004x/examples/fsi/fsi_ex16_daisy_handshake_lead.c
//#############################################################################
//
// FILE:   fsi_ex16_daisy_handshake_lead.c
//
// TITLE:  FSI daisy chain topology, lead device example
//! \addtogroup driver_example_list
//! <h1> FSI daisy chain topology, lead device example </h1>
//! fsi_ex16_daisy_handshake_lead is for the lead device in the daisy-chain
//!     loop, fsi_ex16_daisy_handshake_node for the other N-1 devices(N>=2).
//!
//! In the code, there are different settings provided:
//! [#define FSI_DMA_ENABLE 0] represents FSI communication using CPU control.
//! [#define FSI_DMA_ENABLE 1] represents FSI communication using DMA control,
//!     enabling FSIRX to trigger a DMA event and move the RX FSI data to the
//!     TX FSI buffer
//!
//! In a real scenario two separate devices may power up in arbitrary order and
//! there is a need to establish a clean communication link which ensures that
//! receiver side is flushed to properly interpret the start of a new valid
//! frame.
//!
//! The node devices in the daisy chain topology respond to the handshake
//! sequence and forwards the information  to the next device in the chain.
//!
//! After above synchronization steps, FSI Rx can be configured as per use case
//! i.e. nWords, lane width, enabling events, etc and start the infinite
//! transfers. More details on establishing the communication link can be found
//! in the device TRM.
//!
//! User can edit some of configuration parameters as per use case, similar to
//! other examples.
//!
//! \b nWords - Number of words per transfer may be from 1 -16
//! \b nLanes - Choice to select single or double lane for frame transfers
//! \b txUserData - User data to be sent with Data frame
//! \b txDataFrameTag - Frame tag used for Data transfers
//! \b txPingFrameTag - Frame tag used for Ping transfers
//! \b txPingTimeRefCntr - Tx Ping timer reference counter
//! \b rxWdTimeoutRefCntr - Rx Watchdog timeout reference counter
//!
//!\b External \b Connections \n
//!  For the FSI daisy-chain topology external connections are required to
//!  be made between the devices in the chain. Each devices FSI TX pins need to
//!  be connected to the FSI RX pins of the next device in the chain (or ring).
//!  See below for external connections to include and GPIOs used:
//!
//!  External Connections Required:
//!     - FSIRX_CLK  to  FSITX_CLK
//!     - FSIRX_RX0  to  FSITX_TX0
//!     - FSIRX_RX1  to  FSITX_TX1
//!
//!  ControlCard FSI Header GPIOs:
//!     - GPIO_27  ->    FSITX_CLK
//!     - GPIO_26  ->    FSITX_TX0
//!     - GPIO_25  ->    FSITX_TX1
//!     - GPIO_13  ->    FSIRX_CLK
//!     - GPIO_12  ->    FSIRX_RX0
//!     - GPIO_11  ->    FSIRX_RX1
//!  LaunchPad FSI Header GPIOs:
//!     - GPIO_7   ->    FSITX_CLK
//!     - GPIO_6   ->    FSITX_TX0
//!     - GPIO_25   ->    FSITX_TX1
//!     - GPIO_33  ->    FSIRX_CLK
//!     - GPIO_12  ->    FSIRX_RX0
//!     - GPIO_2  ->    FSIRX_RX1
//!
//! \b Watch \b Variables \n
//!  - \b dataFrameCntr  Number of Data frames received back
//!  - \b error          Non zero for transmit/receive data mismatch
//
//#############################################################################
//
//
// $Copyright:
// Copyright (C) 2023 Texas Instruments Incorporated - http://www.ti.com/
//
// Redistribution and use in source and binary forms, with or without 
// modification, are permitted provided that the following conditions 
// are met:
// 
//   Redistributions of source code must retain the above copyright 
//   notice, this list of conditions and the following disclaimer.
// 
//   Redistributions in binary form must reproduce the above copyright
//   notice, this list of conditions and the following disclaimer in the 
//   documentation and/or other materials provided with the   
//   distribution.
// 
//   Neither the name of Texas Instruments Incorporated nor the names of
//   its contributors may be used to endorse or promote products derived
//   from this software without specific prior written permission.
// 
// THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 
// "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT 
// LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
// A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT 
// OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, 
// SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT 
// LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
// DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
// THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT 
// (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE 
// OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
// $
//#############################################################################

//
// Included Files
//
#include "driverlib.h"
#include "device.h"

#define FSI_DMA_ENABLE              1
#define TX_DMA_TRIGGER_ENABLE       0

#define PRESCALER_VAL    FSI_PRESCALE_50MHZ

#define FSI_DELAY_LINE_CALIBRATION_ENABLE   0

#define DMA_TRANSFER_SIZE_IN_BURSTS 1U
#define DMA_WRAP_SIZE_IN_BURSTS     1U
#define TOTAL_WORDS_IN_TRANSFER (DMA_TRANSFER_SIZE_IN_BURSTS * nWords)

// GS0 RAM to store Tx frame data which DMA will read
#define GS0_START_ADDR  0xC100
// GS1 RAM to store Tx frame tag and Userdata
#define GS1_START_ADDR  0xE000
// GS2 RAM to save received Rx frame data
#define GS2_START_ADDR  0x10000
// GS3 RAM to save received Rx frame tag and Userdata
#define GS3_START_ADDR  0x12000

//
// FSI Tx/Rx Frame tag User Data register address, used by DMA channel to
// write(and trigger transfer) read userdata respectively
//
#define FSI_TX_FRAME_TAG_UDATA_REGADDR (FSITXA_BASE + FSI_O_TX_FRAME_TAG_UDATA)
#define FSI_RX_FRAME_TAG_UDATA_REGADDR (FSIRXA_BASE + FSI_O_RX_FRAME_TAG_UDATA)

#define DATA_FRAME_TEST_IO           16
#define DATA_FRAME_TEST_IO_CONF      GPIO_16_GPIO16

//
// Globals, User can modify these parameters as per usecase
//
// Number of words per transfer may be from 1 -16
//
uint16_t nWords = 8;

// Transfer can be happen over single or double lane
FSI_DataWidth nLanes = FSI_DATA_WIDTH_1_LANE;

// Frame tag used with Data/Ping transfers
FSI_FrameTag txDataFrameTag = FSI_FRAME_TAG10, txPingFrameTag = FSI_FRAME_TAG15;

// User data to be sent with Data frame(for CPU control)
uint16_t txUserData = 0x47;

