TexasInstruments/c2000ware-core-sdk/driverlib/f28004x/examples/fsi/fsi_ex16_daisy_handshake_lead.c
// Tx Ping timer and Rx Watchdog reference counter values
uint32_t txPingTimeRefCntr = 0x1000000, rxWdTimeoutRefCntr = 0x1400000;

// Boolean flag to enable/disable Rx Frame Watchdog
bool isRxFrameWdEnable = true;

//
// This value can be anything suitable to generate a single interrupt event,
// lower values may lead WD to trigger another event even before handler of 1st
// one is not completed
//
uint32_t rxFrameWdRefCntr = 0x1000000;

//
// Globals, these are not config parameters, user are not required to edit them
//
uint16_t txEventSts = 0, rxEventSts = 0;
uint16_t *txBufAddr = 0, *rxBufAddr = 0;

uint16_t txBufData[16] = {0};
uint16_t rxBufData[16] = {0};
volatile uint32_t fsiTxInt1Received = 0,fsiTxInt2Received = 0;
volatile uint32_t fsiRxInt1Received = 0,fsiRxInt2Received = 0;
uint32_t txTimeOutCntr = 0x100000, rxTimeOutCntr = 0x100000;
uint32_t dataFrameCntr = 0, dataFrameCntr_ui32 = 0;

uint32_t dmaIntr1 = 0, dmaIntr2 = 0;
volatile uint16_t i = 0, *txTempData16 = 0, *rxTempData16 = 0;
uint32_t dmaTxIntCnt = 0, dmaRxIntCnt = 0;
uint32_t error = 0;

//
// Function Prototypes
//
static inline void compare16(uint16_t val1, uint16_t val2);
void compareBufData(uint16_t txBufIndex, uint16_t rxBufIndex, uint16_t nWords);
void disableAllFSIInterrupts(void);
void checkReceivedFrameTypeTag(FSI_FrameType type, FSI_FrameTag tag);
void initFSI(void);
void prepareTxBufData(void);
void testGPIO(void);
__interrupt void fsiTxInt1ISR(void);
__interrupt void fsiTxInt2ISR(void);
__interrupt void fsiRxInt1ISR(void);
__interrupt void fsiRxInt2ISR(void);
__interrupt void fsitxdma_isr(void);
__interrupt void fsirxdma_isr(void);
void fsitx_dma_config();
void fsirx_dma_config();
void InitFrameTagAndData();
void UpdateTxframeData();
void handshake_lead(void);

//
// Main
//
void main(void)
{
    //
    // Initialize device clock and peripherals
    //
    Device_init();

    //
    // Disable pin locks and enable internal pullups.
    //
    Device_initGPIO();
    testGPIO();

    //
    // Initialize PIE and clear PIE registers. Disables CPU interrupts.
    //
    Interrupt_initModule();

    //
    // Initialize the PIE vector table with pointers to the shell Interrupt
    // Service Routines (ISR).
    //
    Interrupt_initVectorTable();

    //
    // Initialize basic settings for FSI
    //
    initFSI();

    //
    // Interrupts that are used in this example are re-mapped to ISR functions
    // found within this file. Total 4; FSI Tx/Rx :: INT1/INT2
    //
    Interrupt_register(INT_FSITXA_INT1, &fsiTxInt1ISR);
    Interrupt_register(INT_FSITXA_INT2, &fsiTxInt2ISR);
    Interrupt_register(INT_FSIRXA_INT1, &fsiRxInt1ISR);
    Interrupt_register(INT_FSIRXA_INT2, &fsiRxInt2ISR);

    //
    // Enable FSI Tx/Rx interrupts
    //
    Interrupt_enable(INT_FSITXA_INT1);
    Interrupt_enable(INT_FSITXA_INT2);
    Interrupt_enable(INT_FSIRXA_INT1);
    Interrupt_enable(INT_FSIRXA_INT2);

#if FSI_DMA_ENABLE==1

    //
    // DMA Interrupts that are used in this example are re-mapped to ISR functions
    // found within this file.
    //
    Interrupt_register(INT_DMA_CH2, &fsitxdma_isr);
    Interrupt_register(INT_DMA_CH4, &fsirxdma_isr);

    //
    // Enable DMA interrupts
    //
    Interrupt_enable(INT_DMA_CH2);
    Interrupt_enable(INT_DMA_CH4);

#endif

    //
    // Enable Global Interrupt (INTM) and realtime interrupt (DBGM)
    //
    EINT;
    ERTM;

    //
    // Enable normal data receive events to be sent over INT1 line
    //
    FSI_enableRxInterrupt(FSIRXA_BASE, FSI_INT1, FSI_RX_EVT_PING_FRAME);

    //
    // Begin handshake -
    // Wait till interrupt is received on FSIRX INT1 line, verify it's for FRAME
    // DONE event for PING Frame reception
    //
    handshake_lead();

#if FSI_DELAY_LINE_CALIBRATION_ENABLE

    // TODO - Implement FSI RX delay line calibration here
    //          to compensate for channel-to-channel skew.
    //          See Application Report SPRACJ9 and respective
    //          software examples within C2000ware.

#endif

    // Setting for requested nWords and nLanes with transfers
    FSI_setTxFrameType(FSITXA_BASE, FSI_FRAME_TYPE_NWORD_DATA);
    FSI_setTxSoftwareFrameSize(FSITXA_BASE, nWords);
    FSI_setTxDataWidth(FSITXA_BASE, nLanes);
    // RX setting part
    FSI_setRxSoftwareFrameSize(FSIRXA_BASE, nWords);
    FSI_setRxDataWidth(FSIRXA_BASE, nLanes);


    //
    // Enable transmit/receive error events to be sent over INT2 line
    // Overrun and Underrun conditions in Rx are not enabled as buffer pointers
    // are always overwritten to first location for sending data frames.
    //
    FSI_enableRxInterrupt(FSIRXA_BASE, FSI_INT2, FSI_RX_EVT_CRC_ERR  |
                                                 FSI_RX_EVT_EOF_ERR  |
                                                 FSI_RX_EVT_TYPE_ERR);

    FSI_disableRxInterrupt(FSIRXA_BASE, FSI_INT1, FSI_RX_EVT_PING_FRAME);
    DEVICE_DELAY_US(10);

    FSI_enableTxInterrupt(FSITXA_BASE, FSI_INT1, FSI_TX_EVT_FRAME_DONE);

    DEVICE_DELAY_US(1000); // Delay needed for Node setup time

    #if FSI_DMA_ENABLE==0

    FSI_setTxUserDefinedData(FSITXA_BASE, txUserData);
    FSI_setTxFrameTag(FSITXA_BASE, txDataFrameTag);

    FSI_enableRxInterrupt(FSIRXA_BASE, FSI_INT1, FSI_RX_EVT_DATA_FRAME);

    #else

    //
    // Initialize the dma channels for both tx and rx buffers
    //
    DMA_initController();

    fsirx_dma_config();
    fsitx_dma_config();

    FSI_setTxStartMode(FSITXA_BASE, FSI_TX_START_FRAME_CTRL_OR_UDATA_TAG);

    #if TX_DMA_TRIGGER_ENABLE == 1
    // Enable DMA event on FSI Tx
    FSI_enableTxDMAEvent(FSITXA_BASE);
    #endif

    // Enable DMA event on FSI Rx
    FSI_enableRxDMAEvent(FSIRXA_BASE);

    InitFrameTagAndData();

    // Start TX /RX channels

    DMA_startChannel(DMA_CH1_BASE);
    DMA_startChannel(DMA_CH2_BASE);

    DMA_startChannel(DMA_CH3_BASE);
    DMA_startChannel(DMA_CH4_BASE);

    // use software to trigger the first transfer
    DMA_forceTrigger(DMA_CH1_BASE);
    DMA_forceTrigger(DMA_CH2_BASE);
    #endif

    while(1)
    {

    #if FSI_DMA_ENABLE==0

