TexasInstruments/c2000ware-core-sdk/driverlib/f28004x/examples/fsi/fsi_ex16_daisy_handshake_lead.c
    if((rxEventSts & FSI_RX_EVT_DATA_FRAME) != 0)
    {
        //
        // Verify TX data is same as RX data
        //
        checkReceivedFrameTypeTag(FSI_FRAME_TYPE_NWORD_DATA, txDataFrameTag);
        compare16(FSI_getRxUserDefinedData(FSIRXA_BASE), txUserData);
        compareBufData(0, 0, nWords);

        dataFrameCntr++;

        if(dataFrameCntr >= 0xFFFFFFFF)
        {
            dataFrameCntr_ui32++;
            dataFrameCntr = 0;
        }
    }

    fsiRxInt1Received = 1U;

    // Set FSI RX circular buffer pointer back to beginning
    FSI_setRxBufferPtr(FSIRXA_BASE, 0U);

    //
    // Clear the interrupt flag and issue ACK
    //
    FSI_clearRxEvents(FSIRXA_BASE,rxEventSts);
    Interrupt_clearACKGroup(INTERRUPT_ACK_GROUP7);
}

//
// fsiRxInt2ISR - FSI Rx Interrupt on INT2 line
//
__interrupt void fsiRxInt2ISR(void)
{
    rxEventSts = FSI_getRxEventStatus(FSIRXA_BASE);

    fsiRxInt2Received = fsiRxInt2Received + 1U;

    //
    // Clear the interrupt flag and issue ACK
    //
    FSI_clearRxEvents(FSIRXA_BASE,rxEventSts);
    Interrupt_clearACKGroup(INTERRUPT_ACK_GROUP7);

    disableAllFSIInterrupts();

    //
    // INT2 line is set to fire for error events, stop immediately. Error
    // is captured in rxEventSts for debug
    //11.24
    ESTOP0;
}

//
// disableAllFSIInterrupts - Disables all event interrupts in both FSI Tx/Rx,
//                           also clear them
//
void disableAllFSIInterrupts(void)
{
    FSI_disableTxInterrupt(FSITXA_BASE, FSI_INT1, FSI_TX_EVTMASK);
    FSI_disableTxInterrupt(FSITXA_BASE, FSI_INT2, FSI_TX_EVTMASK);
    FSI_disableRxInterrupt(FSIRXA_BASE, FSI_INT1, FSI_RX_EVTMASK);
    FSI_disableRxInterrupt(FSIRXA_BASE, FSI_INT2, FSI_RX_EVTMASK);

    FSI_clearTxEvents(FSITXA_BASE, FSI_TX_EVTMASK);
    FSI_clearRxEvents(FSIRXA_BASE, FSI_RX_EVTMASK);
}

//
// compare16 - Compares two 16 bit values and increments global error flag by 1
//             for mismatch
//
static inline void compare16(uint16_t val1, uint16_t val2)
{
    if(val1 != val2)
    {
        error++;
    }
}

//
// compareBufData - Compares if received data is same as transmitted ones
//                  It doesn't consider wrap-up cases, but, can be enhanced
//
void compareBufData(uint16_t txBufIndex, uint16_t rxBufIndex, uint16_t nWords)
{
    uint16_t i;
    uint16_t rxDataArray[16];

    FSI_readRxBuffer(FSIRXA_BASE, rxDataArray, nWords, rxBufIndex);

    for(i = 0; i < nWords; i++)
    {
        if(rxDataArray[i] != txBufAddr[txBufIndex])
        {
            error++;
            return;
        }

        txBufIndex++;
    }
}

//
// checkReceivedFrameTypeTag - Checks received frame type/tag and updates global
//                             error flag
//
void checkReceivedFrameTypeTag(FSI_FrameType type, FSI_FrameTag tag)
{
    compare16((uint16_t)FSI_getRxFrameType(FSIRXA_BASE), (uint16_t)type);

    if(type == FSI_FRAME_TYPE_PING)
    {
        compare16(FSI_getRxPingTag(FSIRXA_BASE), (uint16_t)tag);
    }
    else
    {
        compare16(FSI_getRxFrameTag(FSIRXA_BASE), (uint16_t)tag);
    }
}

void testGPIO(void)
{
    GPIO_setDirectionMode(DATA_FRAME_TEST_IO,GPIO_DIR_MODE_OUT);
    GPIO_setQualificationMode(DATA_FRAME_TEST_IO,GPIO_QUAL_ASYNC);
    GPIO_setPinConfig(DATA_FRAME_TEST_IO_CONF);

    GPIO_writePin(DATA_FRAME_TEST_IO,1);
}

//
// fsitx_dma_config - Sets up DMA channels(Ch1 and Ch2) for FSI Tx operation
//
void fsitx_dma_config()
{
    //
    // GS0 RAM to store Tx frame data which DMA will read
    // for the data buffers
    //
    DMA_configAddresses(DMA_CH1_BASE, txBufAddr, (uint16_t *)GS0_START_ADDR);
    DMA_configBurst(DMA_CH1_BASE, nWords, 1, 1);
    DMA_configTransfer(DMA_CH1_BASE, DMA_TRANSFER_SIZE_IN_BURSTS, 0, 0);
    DMA_configWrap(DMA_CH1_BASE, DMA_WRAP_SIZE_IN_BURSTS, 0,
                   DMA_WRAP_SIZE_IN_BURSTS, 0);

    #if TX_DMA_TRIGGER_ENABLE == 1
    DMA_configMode(DMA_CH1_BASE, DMA_TRIGGER_FSITXA, DMA_CFG_ONESHOT_DISABLE|
                   DMA_CFG_CONTINUOUS_ENABLE | DMA_CFG_SIZE_16BIT);
    #else
    DMA_configMode(DMA_CH1_BASE, DMA_TRIGGER_SOFTWARE, DMA_CFG_ONESHOT_DISABLE|
                   DMA_CFG_CONTINUOUS_ENABLE | DMA_CFG_SIZE_16BIT);
    #endif

    DMA_disableInterrupt(DMA_CH1_BASE);
    DMA_enableTrigger(DMA_CH1_BASE);

    //
    // For the tag and userdata fields
    //
    DMA_configAddresses(DMA_CH2_BASE, (uint16_t *)FSI_TX_FRAME_TAG_UDATA_REGADDR,
                        (uint16_t *)GS1_START_ADDR);
    DMA_configBurst(DMA_CH2_BASE, 1, 0, 0);
    DMA_configTransfer(DMA_CH2_BASE, DMA_TRANSFER_SIZE_IN_BURSTS, 0, 0);
    DMA_configWrap(DMA_CH2_BASE, DMA_WRAP_SIZE_IN_BURSTS, 0,
                   DMA_WRAP_SIZE_IN_BURSTS, 0);

    #if TX_DMA_TRIGGER_ENABLE == 1
    DMA_configMode(DMA_CH2_BASE, DMA_TRIGGER_FSITXA, DMA_CFG_ONESHOT_DISABLE|
                   DMA_CFG_CONTINUOUS_ENABLE | DMA_CFG_SIZE_16BIT);
    #else
    DMA_configMode(DMA_CH2_BASE, DMA_TRIGGER_SOFTWARE, DMA_CFG_ONESHOT_DISABLE|
                   DMA_CFG_CONTINUOUS_ENABLE | DMA_CFG_SIZE_16BIT);
    #endif

    DMA_setInterruptMode(DMA_CH2_BASE, DMA_INT_AT_END);
    DMA_enableInterrupt(DMA_CH2_BASE);

    DMA_enableTrigger(DMA_CH2_BASE);
}

//
// fsirx_dma_config - Sets up DMA channels(Ch3 and Ch4) for FSI Rx operation
//
void fsirx_dma_config()
{
    //
    // GS2 RAM to save received Rx frame data
    //
    DMA_configAddresses(DMA_CH3_BASE, (uint16_t *)GS2_START_ADDR, rxBufAddr);
    DMA_configBurst(DMA_CH3_BASE, nWords, 1, 1);
    DMA_configTransfer(DMA_CH3_BASE, DMA_TRANSFER_SIZE_IN_BURSTS, 0, 0);
    DMA_configWrap(DMA_CH3_BASE, DMA_WRAP_SIZE_IN_BURSTS, 0,
                   DMA_WRAP_SIZE_IN_BURSTS, 0);
    DMA_configMode(DMA_CH3_BASE, DMA_TRIGGER_FSIRXA, DMA_CFG_ONESHOT_DISABLE|
                   DMA_CFG_CONTINUOUS_ENABLE |DMA_CFG_SIZE_16BIT);

    DMA_disableInterrupt(DMA_CH3_BASE);
    DMA_enableTrigger(DMA_CH3_BASE);

    //
    // For the tag and userdata fields
    //
    DMA_configAddresses(DMA_CH4_BASE,(uint16_t *)GS3_START_ADDR,
                        (uint16_t *)FSI_RX_FRAME_TAG_UDATA_REGADDR);
    DMA_configBurst(DMA_CH4_BASE, 1, 0, 0);
    DMA_configTransfer(DMA_CH4_BASE, DMA_TRANSFER_SIZE_IN_BURSTS, 0, 0);
    DMA_configWrap(DMA_CH4_BASE, DMA_WRAP_SIZE_IN_BURSTS, 0,
                   DMA_WRAP_SIZE_IN_BURSTS, 0);
    DMA_configMode(DMA_CH4_BASE, DMA_TRIGGER_FSIRXA, DMA_CFG_ONESHOT_DISABLE |
                   DMA_CFG_CONTINUOUS_ENABLE | DMA_CFG_SIZE_16BIT);

    DMA_setInterruptMode(DMA_CH4_BASE, DMA_INT_AT_END);
    DMA_enableInterrupt(DMA_CH4_BASE);
    DMA_enableTrigger(DMA_CH4_BASE);
}

//
// InitFrameTagAndData - Initializes GS0/GS1 memories to populate tag and data
//                       for frame transfers
//
void InitFrameTagAndData(void)
{
    unsigned int i;
    uint16_t *temp;

