TexasInstruments/c2000ware-core-sdk/driverlib/f28004x/examples/fsi/fsi_ex16_daisy_handshake_lead.c
    temp = (uint16_t *)GS0_START_ADDR;
    for(i = 0; i < TOTAL_WORDS_IN_TRANSFER; i++)
    {
        *temp = i;
        temp++;
    }

    temp = (uint16_t *)GS1_START_ADDR;
    for(i = FSI_FRAME_TAG0; i < FSI_FRAME_TAG15; i++)
    {
        //
        //tag and user data
        //
        *temp = ((0x0 + i) | ((unsigned long)(0x0 + i) << 8));
        temp++;
    }
}

//
// UpdateTxframeData - Updates GS0 memory with new data for frame transfer
//
void UpdateTxframeData(void)
{
    unsigned int i;
    uint16_t *temp;

    temp = (uint16_t *)GS0_START_ADDR;
    for(i = 0; i < TOTAL_WORDS_IN_TRANSFER; i++)
    {
        *temp = *temp + 1;
        temp++;
    }

}

//
// fsitxdma_isr - FSI TX DMA ISR
//
interrupt void fsitxdma_isr(void)
{
    GPIO_writePin(DATA_FRAME_TEST_IO,0);

    dmaTxIntCnt++; // Increment DMA TX interrupt counter

    dmaIntr1 = 1;
    Interrupt_clearACKGroup(INTERRUPT_ACK_GROUP7);
}

//
// fsirxdma_isr - FSI RX DMA ISR
//
interrupt void fsirxdma_isr(void)
{
    GPIO_writePin(DATA_FRAME_TEST_IO,1);

    // Set FSI RX circular buffer pointer back to beginning
    FSI_setRxBufferPtr(FSIRXA_BASE, 0U);

    dmaRxIntCnt++; // Increment DMA RX interrupt counter

    #if TX_DMA_TRIGGER_ENABLE == 0

    //
    // Verify TX data is same as RX data
    //
    txTempData16 = (uint16_t *)(GS0_START_ADDR);
    rxTempData16 = (uint16_t *)(GS2_START_ADDR);

    for(i = 0; i < TOTAL_WORDS_IN_TRANSFER; i++)
    {
        compare16(*txTempData16,*rxTempData16);
        txTempData16++;
        rxTempData16++;
    }

    dataFrameCntr++;

    if(dataFrameCntr >= 0xFFFFFFFF)
    {
        dataFrameCntr_ui32++;
        dataFrameCntr = 0;
    }

    UpdateTxframeData(); // Update TX Frame data (GS0 memory)

    // Trigger TX DMA channels 1 & 2
    DMA_forceTrigger(DMA_CH1_BASE);
    DMA_forceTrigger(DMA_CH2_BASE);

    #endif

    dmaIntr2 = 1;
    Interrupt_clearACKGroup(INTERRUPT_ACK_GROUP7);
}
//
// End of File
//

